In [2]:
import pandas as pd

In [3]:
cprices = pd.read_excel('data/competitor_prices.xlsx')
cprices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37062 entries, 0 to 37061
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Site_ID            37062 non-null  int64
 1   Competitor_ID      37062 non-null  int64
 2   Grade_Description  37062 non-null  object
 3   Date               37062 non-null  datetime64[ns]
 4   Competitor_Price   29573 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(1)
memory usage: 1.4+ MB

**Missing competitor prices, missing matching days, many unneeded days

In [4]:
sprices = pd.read_excel('data/site_prices.xlsx')
sprices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6579 entries, 0 to 6578
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Site_ID            6579 non-null   int64
 1   Grade_Description  6579 non-null   object
 2   Date               6579 non-null   datetime64[ns]
 3   Price              6579 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 205.7+ KB

In [5]:
sprofit = pd.read_excel('data/site_profit.xlsx')
sprofit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6579 entries, 0 to 6578
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Site_ID            6579 non-null   int64
 1   Grade_Description  6579 non-null   object
 2   Date               6579 non-null   datetime64[ns]
 3   Profit             5914 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 205.7+ KB

**Missing profits

In [6]:
sreplace = pd.read_excel('data/site_replacement_cost.xlsx')
sreplace.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 853 entries, 0 to 852
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date               853 non-null    datetime64[ns]
 1   Unleaded Gas Cost  853 non-null    float64
 2   Diesel Cost        853 non-null    float64
 3   Midgrade Gas Cost  853 non-null    float64
 4   Premium Gas Cost   853 non-null    float64
dtypes: datetime64[ns](1), float64(4)
memory usage: 33.4 KB

In [7]:
svol = pd.read_excel('data/site_volume.xlsx')
svol.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6579 entries, 0 to 6578
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Site_ID            6579 non-null   int64
 1   Grade_Description  6579 non-null   object
 2   Date               6579 non-null   datetime64[ns]
 3   Volume             5930 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 205.7+ KB

**Missing vols

In [10]:
cprices.head()

   Site_ID  Competitor_ID Grade_Description       Date  Competitor_Price
0    10808         311365            Diesel 2019-08-27             2.429
1    10808         311365            Diesel 2019-08-28             2.429
2    10808         311365            Diesel 2019-08-29             2.429
3    10808         311365            Diesel 2019-08-30             2.429
4    10808         311365            Diesel 2019-08-31             2.429

In [11]:
sprices.head()

   Site_ID Grade_Description       Date  Price
0    10808      Unleaded Gas 2019-01-01  1.769
1    10808      Unleaded Gas 2019-01-02  1.759
2    10808      Unleaded Gas 2019-01-03  1.749
3    10808      Unleaded Gas 2019-01-04  1.749
4    10808      Unleaded Gas 2019-01-05  1.749

In [12]:
sprofit.head()

   Site_ID Grade_Description       Date  Profit
0    10808      Unleaded Gas 2019-01-01    9.73
1    10808      Unleaded Gas 2019-01-02   11.13
2    10808      Unleaded Gas 2019-01-03  -35.83
3    10808      Unleaded Gas 2019-01-04  -65.66
4    10808      Unleaded Gas 2019-01-05  -98.64

In [13]:
sreplace.head()

,Date,Unleaded Gas Cost,Diesel Cost,Midgrade Gas Cost,Premium Gas Cost
0,2018-12-01,1.4413,1.287061,1.527463,1.628971
1,2018-12-02,1.4413,1.283675,1.522660,1.629263
2,2018-12-03,1.4314,1.290575,1.535742,1.618202
3,2018-12-04,1.4434,1.313937,1.573385,1.650614
4,2018-12-05,1.4456,1.285454,1.538296,1.632224

In [14]:
svol.head()

   Site_ID Grade_Description       Date   Volume
0    10808      Unleaded Gas 2019-01-01  1092.01
1    10808      Unleaded Gas 2019-01-02  1955.47
2    10808      Unleaded Gas 2019-01-03  1123.79
3    10808      Unleaded Gas 2019-01-04  1847.51
4    10808      Unleaded Gas 2019-01-05  1442.89